# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai
#  ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.
# 4 -> 1 2 3 4
# 9

n = int(input("Enter qty of bushes: "))
my_bushes = []

for i in range(n):
    bush = int(input("Enter qty of berries: "))
    my_bushes.append(bush)
my_bushes_counted = []
for i in range(len(my_bushes) - 1):
    my_bushes_counted.append(my_bushes[i-1] + my_bushes[i] + my_bushes[i+1])
    my_bushes_counted.append(my_bushes[-2] + my_bushes[-1] + my_bushes[0])
print(max(my_bushes_counted))
